### production environment
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.cloudflare_zone.main: Reading...
data.cloudflare_zone.main: Read complete after 1s
data.azuread_client_config.current: Reading...
data.azuread_client_config.current: Read complete after 0s [id=ffab38df-cddf-433f-859a-6cfa161a5ceb-6380c778-7078-4cf9-86bd-5a6371b1c2c9-40a08517-ff80-4b40-b4e2-7c167a17825d]
data.azurerm_client_config.current: Reading...
data.azurerm_container_registry.main: Reading...
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD02MzgwYzc3OC03MDc4LTRjZjktODZiZC01YTYzNzFiMWMyYzk7b2JqZWN0SWQ9NDBhMDg1MTctZmY4MC00YjQwLWI0ZTItN2MxNjdhMTc4MjVkO3N1YnNjcmlwdGlvbklkPTE2ZTAxYTAwLWY4MjUtNGM5Ni04YWUyLWU2OGNiNTJjZjY1Mzt0ZW5hbnRJZD1mZmFiMzhkZi1jZGRmLTQzM2YtODU5YS02Y2ZhMTYxYTVjZWI=]
azurerm_static_web_app.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.Web/staticSites/stapp-tshort-prod-001]
azurerm_application_insights.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.Insights/components/appi-tshort-prod-westeurope-001]
azurerm_user_assigned_identity.api: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.ManagedIdentity/userAssignedIdentities/id-tshort-prod-westeurope-001]
azurerm_log_analytics_workspace.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.OperationalInsights/workspaces/log-tshort-prod-westeurope-001]
data.azurerm_container_registry.main: Read complete after 1s [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-shared-westeurope-001/providers/Microsoft.ContainerRegistry/registries/crtshortwesteurope001]
azurerm_role_assignment.api_acr_pull: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-shared-westeurope-001/providers/Microsoft.ContainerRegistry/registries/crtshortwesteurope001/providers/Microsoft.Authorization/roleAssignments/37f5c059-42ad-4cd0-5949-568971bff5b6]
azuread_group.sql_server_admins: Refreshing state... [id=/groups/796bce82-0645-4c49-8c2c-77d0240f9ec2]
azurerm_container_app_environment.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.App/managedEnvironments/cae-tshort-prod-westeurope-001]
time_sleep.group_provisioning: Refreshing state... [id=2025-01-05T03:02:44Z]
azurerm_mssql_server.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.Sql/servers/sql-tshort-prod-westeurope-001]
cloudflare_dns_record.primary: Refreshing state... [id=4ae81ada11d0508bdf9e7124832420ff]
time_sleep.wait_for_dns_record: Refreshing state... [id=2025-01-05T04:40:54Z]
azurerm_static_web_app_custom_domain.primary: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.Web/staticSites/stapp-tshort-prod-001/customDomains/admin.tshort.me]
azurerm_mssql_firewall_rule.main: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.Sql/servers/sql-tshort-prod-westeurope-001/firewallRules/AllowAzureServices]
azapi_resource.sql_database: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.Sql/servers/sql-tshort-prod-westeurope-001/databases/sqldb-tshort]
azurerm_container_app.api: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.App/containerApps/aca-tshort-api-prod-001]
cloudflare_dns_record.asuid_api: Refreshing state... [id=3f473b3261a71bc41a22332566f3e49c]
cloudflare_dns_record.api: Refreshing state... [id=fff7ce9dd7dcb41ffc3e2f595667d5a8]
time_sleep.api_custom_domain_records: Refreshing state... [id=2025-01-05T04:41:14Z]
azurerm_container_app_custom_domain.api: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.App/containerApps/aca-tshort-api-prod-001/customDomainName/tshort.me]
azapi_resource_action.destroy_custom_domain_binding: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.App/containerApps/aca-tshort-api-prod-001]
azapi_resource.managed_certificate: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.App/managedEnvironments/cae-tshort-prod-westeurope-001/managedCertificates/aca-tshort-api-prod-001]
azapi_resource_action.apply_custom_domain_binding: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.App/containerApps/aca-tshort-api-prod-001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_container_app.api will be updated in-place
  ~ resource "azurerm_container_app" "api" {
        id                            = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-tshort-prod-westeurope-001/providers/Microsoft.App/containerApps/aca-tshort-api-prod-001"
        name                          = "aca-tshort-api-prod-001"
        tags                          = {
            "environment" = "Production"
            "managed-by"  = "Terraform"
            "project"     = "TShort"
        }
        # (10 unchanged attributes hidden)

      ~ template {
            # (4 unchanged attributes hidden)

          ~ container {
              ~ image             = "crtshortwesteurope001.azurecr.io/tshort-api:0.1.0-beta.5" -> "crtshortwesteurope001.azurecr.io/placeholder"
                name              = "tshort-api"
                # (5 unchanged attributes hidden)

                # (3 unchanged blocks hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # cloudflare_dns_record.asuid_api will be updated in-place
  ~ resource "cloudflare_dns_record" "asuid_api" {
      ~ comment_modified_on = "2025-01-03T17:56:05Z" -> (known after apply)
      ~ created_on          = "2025-01-03T17:56:05Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "3f473b3261a71bc41a22332566f3e49c"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-01-03T17:56:05Z" -> (known after apply)
      ~ name                = "asuid.tshort.me" -> "asuid"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # cloudflare_dns_record.primary will be updated in-place
  ~ resource "cloudflare_dns_record" "primary" {
      ~ comment_modified_on = "2025-01-03T00:01:27Z" -> (known after apply)
      ~ created_on          = "2025-01-03T00:01:27Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "4ae81ada11d0508bdf9e7124832420ff"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-01-03T00:01:27Z" -> (known after apply)
      ~ name                = "admin.tshort.me" -> "admin"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>